# StandardScaler done Column by Column Operation

In [18]:
# Most of the problems will be solved using Standardization

In [1]:
import pandas as pd
df = pd.read_csv('supershops.csv')

In [2]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [3]:
df.tail()

    Marketing Spend  Administration  Transport     Area    Profit
45          1000.23       124153.04    1903.93    Dhaka  64926.08
46          1315.46       115816.21  297114.46  Rangpur  49490.75
47             0.00       135426.92       0.00      Ctg  42559.73
48           542.05        51743.15       0.00    Dhaka  35673.41
49             0.00       116983.80   45173.06      Ctg  14681.40

In [4]:
df.shape

(50, 5)

In [5]:
df.dtypes

Marketing Spend    float64
Administration     float64
Transport          float64
Area                object
Profit             float64
dtype: object

In [6]:
'''The iloc() function in python is defined in the Pandas module 
that helps us to select a specific row or column from the data set.'''

#The syntax of the iloc function in python is very simple: pandas.dataset.iloc[row, column]

'The iloc() function in python is defined in the Pandas module \nthat helps us to select a specific row or column from the data set.'

In [7]:
x = df.iloc[:, [0,1,2]]                     # x = df.drop('Profit', axis=1)     . axis=1 for column

In [8]:
x.head()

   Marketing Spend  Administration  Transport
0        114523.61       136897.80  471784.10
1        162597.70       151377.59  443898.53
2        153441.51       101145.55  407934.54
3        144372.41       118671.85  383199.62
4        142107.34        91391.77  366168.42

In [9]:
x.dtypes

Marketing Spend    float64
Administration     float64
Transport          float64
dtype: object

In [10]:
y = df.iloc[:, 4]
y.head()

0    192261.83
1    191792.06
2    191050.39
3    182901.99
4    166187.94
Name: Profit, dtype: float64

# StandardScaler

In [11]:
# from sklearn.preprocessing, we are importing StandardScaler to standardize our variable x.

from sklearn.preprocessing import StandardScaler

In [12]:
std = StandardScaler()

In [13]:
df[['Marketing Spend']] = std.fit_transform(df[['Marketing Spend']])

In [14]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.897913       136897.80  471784.10    Dhaka  192261.83
1         1.955860       151377.59  443898.53      Ctg  191792.06
2         1.754364       101145.55  407934.54  Rangpur  191050.39
3         1.554784       118671.85  383199.62    Dhaka  182901.99
4         1.504937        91391.77  366168.42  Rangpur  166187.94

In [15]:
df.Administration = std.fit_transform(df[['Administration']])

In [16]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.897913        0.560753  471784.10    Dhaka  192261.83
1         1.955860        1.082807  443898.53      Ctg  191792.06
2         1.754364       -0.728257  407934.54  Rangpur  191050.39
3         1.554784       -0.096365  383199.62    Dhaka  182901.99
4         1.504937       -1.079919  366168.42  Rangpur  166187.94

In [17]:
df.Transport = std.fit_transform(df[['Transport']])

In [18]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.897913        0.560753   2.165287    Dhaka  192261.83
1         1.955860        1.082807   1.929843      Ctg  191792.06
2         1.754364       -0.728257   1.626191  Rangpur  191050.39
3         1.554784       -0.096365   1.417348    Dhaka  182901.99
4         1.504937       -1.079919   1.273550  Rangpur  166187.94

In [22]:
df

    Marketing Spend  Administration  Transport     Area     Profit
0          0.897913        0.560753   2.165287    Dhaka  192261.83
1          1.955860        1.082807   1.929843      Ctg  191792.06
2          1.754364       -0.728257   1.626191  Rangpur  191050.39
3          1.554784       -0.096365   1.417348    Dhaka  182901.99
4          1.504937       -1.079919   1.273550  Rangpur  166187.94
5          1.279800       -0.776239   1.245627    Dhaka  156991.12
6          1.340066        0.932147  -0.739753      Ctg  156122.51
7          1.245057        0.871980   0.916470  Rangpur  155752.60
8          1.030369        0.986952   0.812928    Dhaka  152211.77
9          1.091819       -0.456640   0.756935      Ctg  149759.96
10         0.620398       -0.387599   0.116763  Rangpur  146121.95
11         0.593085       -1.065540   0.290555      Ctg  144259.40
12         0.443260        0.215449   0.291357  Rangpur  141585.52
13         0.402078        0.510179   0.315213      Ctg  134307.35
14         1.017181        1.269199   0.347702  Rangpur  132602.65
15         2.016411        0.045868   0.392142    Dhaka  129917.04
16         0.094441        0.009118   0.413839      Ctg  126992.93
17         0.460720        0.855666   0.567745    Dhaka  125370.37
18         0.396725       -0.258465   0.671979  Rangpur  124266.90
19         0.279442        1.159837        NaN    Dhaka  122776.86
20         0.055726       -0.269588   0.703598      Ctg  118474.03
21         0.102724        1.169186   0.712656    Dhaka  111313.02
22         0.006007        0.051850   0.742899  Rangpur  110352.25
23        -0.136201       -0.562211   0.755138  Rangpur  108733.99
24         0.073115       -0.795469  -0.631190    Dhaka  108552.04
25        -0.199312        0.656489  -0.653246      Ctg  107404.34
26         0.035370        0.821718  -0.686280  Rangpur  105733.54
27        -0.035519        0.235069   1.163917    Dhaka  105008.31
28        -0.168793        2.210141  -0.820543  Rangpur  103282.38
29        -0.178609        1.142457  -0.913502    Dhaka  101004.64
30        -0.258074       -0.205629  -1.048654  Rangpur   99937.59
31        -0.276958        1.130554  -1.073249    Dhaka   97483.56
32        -0.226949        0.283924  -1.428988      Ctg   97427.84
33        -0.401129       -0.659324  -0.005884  Rangpur   96778.92
34        -0.600682        1.310535  -0.038282      Ctg   96712.80
35        -0.609750       -1.308658  -0.082863    Dhaka   96479.51
36        -0.991570        0.205925  -0.119935  Rangpur   90708.19
37        -0.652532       -2.525994  -0.154531      Ctg   89949.14
38        -1.177178       -1.997270  -0.253860    Dhaka   81229.06
39        -0.773820       -1.383122  -0.340536      Ctg   81005.76
40        -0.989577       -0.100900  -0.359142      Ctg   78239.91
41        -1.008534       -1.320796  -0.429432  Rangpur   77798.83
42        -1.102106       -0.906938  -0.568488      Ctg   71498.49
43        -1.281134        0.217682  -1.518073    Dhaka   69758.98
44        -1.134305        1.206419  -1.578860      Ctg   65200.33
45        -1.600350        0.101254  -1.802021    Dhaka   64926.08
46        -1.593413       -0.199322   0.690511  Rangpur   49490.75
47        -1.622362        0.507722  -1.818096      Ctg   42559.73
48        -1.610433       -2.509409  -1.818096    Dhaka   35673.41
49        -1.622362       -0.157226  -1.436690      Ctg   14681.40

# StandardScaler Done on 3 columns at a time and convert the resulting array into pandas Dataframe

In [144]:
import numpy as np
import pandas as pd
df = pd.read_csv('supershops.csv')

In [145]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [146]:
x = df.iloc[:, 0:3]

In [147]:
x.head()

   Marketing Spend  Administration  Transport
0        114523.61       136897.80  471784.10
1        162597.70       151377.59  443898.53
2        153441.51       101145.55  407934.54
3        144372.41       118671.85  383199.62
4        142107.34        91391.77  366168.42

In [148]:
y = df.iloc[:, 4]

In [149]:
y.head()

0    192261.83
1    191792.06
2    191050.39
3    182901.99
4    166187.94
Name: Profit, dtype: float64

In [150]:
z = df.iloc[:, 3]

In [151]:
z.head()

0      Dhaka
1        Ctg
2    Rangpur
3      Dhaka
4    Rangpur
Name: Area, dtype: object

In [152]:
from sklearn.preprocessing import StandardScaler

In [153]:
std = StandardScaler()

In [154]:
x = std.fit_transform(x)

In [155]:
x

array([[ 0.89791312,  0.56075291,  2.1652875 ],
       [ 1.95586034,  1.08280658,  1.92984309],
       [ 1.75436374, -0.72825703,  1.62619068],
       [ 1.55478369, -0.09636463,  1.41734795],
       [ 1.5049372 , -1.07991935,  1.27354954],
       [ 1.27980001, -0.77623907,  1.24562725],
       [ 1.34006641,  0.93214721, -0.73975326],
       [ 1.24505666,  0.87198001,  0.91647045],
       [ 1.03036886,  0.9869521 ,  0.81292778],
       [ 1.09181921, -0.45664025,  0.75693503],
       [ 0.62039825, -0.38759909,  0.11676333],
       [ 0.59308542, -1.0655396 ,  0.29055549],
       [ 0.44325987,  0.21544906,  0.29135667],
       [ 0.4020776 ,  0.51017895,  0.31521294],
       [ 1.01718075,  1.26919939,  0.34770243],
       [ 2.01641149,  0.04586785,  0.39214179],
       [ 0.0944412 ,  0.00911842,  0.41383946],
       [ 0.46072013,  0.85566632,  0.56774486],
       [ 0.39672494, -0.25846537,  0.67197878],
       [ 0.27944165,  1.15983657,         nan],
       [ 0.05572609, -0.26958765,  0.70359785],
       [ 0.1027236 ,  1.16918609,  0.71265592],
       [ 0.00600658,  0.05184956,  0.74289933],
       [-0.13620072, -0.56221127,  0.75513755],
       [ 0.0731146 , -0.79546917, -0.63119023],
       [-0.19931169,  0.65648914, -0.65324557],
       [ 0.0353702 ,  0.82171792, -0.68628014],
       [-0.03551899,  0.23506854,  1.16391743],
       [-0.16879272,  2.2101405 , -0.82054336],
       [-0.17860854,  1.14245677, -0.91350185],
       [-0.25807437, -0.20562866, -1.04865389],
       [-0.27695823,  1.13055391, -1.07324912],
       [-0.22694868,  0.28392381, -1.42898775],
       [-0.40112892, -0.65932403, -0.00588428],
       [-0.60068212,  1.31053525, -0.03828215],
       [-0.60974994, -1.30865753, -0.08286268],
       [-0.99157015,  0.20592469, -0.11993541],
       [-0.65253231, -2.52599402, -0.15453072],
       [-1.17717755, -1.99727037, -0.25385963],
       [-0.77382036, -1.38312156, -0.34053619],
       [-0.98957702, -0.10090022, -0.35914195],
       [-1.00853372, -1.32079581, -0.42943154],
       [-1.10210556, -0.90693753, -0.56848824],
       [-1.28113364,  0.21768152, -1.518073  ],
       [-1.13430539,  1.20641936, -1.57885964],
       [-1.60035036,  0.10125394, -1.802021  ],
       [-1.59341322, -0.19932174,  0.69051075],
       [-1.62236202,  0.50772188, -1.81809633],
       [-1.61043334, -2.50940884, -1.81809633],
       [-1.62236202, -0.15722551, -1.43668959]])

In [156]:
df = pd.DataFrame({
    'Marketing Spend':x[:, 0],
    'Administration':x[:, 1],
    'Transport':x[:, 2],
    'Area':z,
    'Profit':y
   
})

print(df)

    Marketing Spend  Administration  Transport     Area     Profit
0          0.897913        0.560753   2.165287    Dhaka  192261.83
1          1.955860        1.082807   1.929843      Ctg  191792.06
2          1.754364       -0.728257   1.626191  Rangpur  191050.39
3          1.554784       -0.096365   1.417348    Dhaka  182901.99
4          1.504937       -1.079919   1.273550  Rangpur  166187.94
5          1.279800       -0.776239   1.245627    Dhaka  156991.12
6          1.340066        0.932147  -0.739753      Ctg  156122.51
7          1.245057        0.871980   0.916470  Rangpur  155752.60
8          1.030369        0.986952   0.812928    Dhaka  152211.77
9          1.091819       -0.456640   0.756935      Ctg  149759.96
10         0.620398       -0.387599   0.116763  Rangpur  146121.95
11         0.593085       -1.065540   0.290555      Ctg  144259.40
12         0.443260        0.215449   0.291357  Rangpur  141585.52
13         0.402078        0.510179   0.315213      Ctg  134307.35
14         1.017181        1.269199   0.347702  Rangpur  132602.65
15         2.016411        0.045868   0.392142    Dhaka  129917.04
16         0.094441        0.009118   0.413839      Ctg  126992.93
17         0.460720        0.855666   0.567745    Dhaka  125370.37
18         0.396725       -0.258465   0.671979  Rangpur  124266.90
19         0.279442        1.159837        NaN    Dhaka  122776.86
20         0.055726       -0.269588   0.703598      Ctg  118474.03
21         0.102724        1.169186   0.712656    Dhaka  111313.02
22         0.006007        0.051850   0.742899  Rangpur  110352.25
23        -0.136201       -0.562211   0.755138  Rangpur  108733.99
24         0.073115       -0.795469  -0.631190    Dhaka  108552.04
25        -0.199312        0.656489  -0.653246      Ctg  107404.34
26         0.035370        0.821718  -0.686280  Rangpur  105733.54
27        -0.035519        0.235069   1.163917    Dhaka  105008.31
28        -0.168793        2.210141  -0.820543  Rangpur  103282.38
29        -0.178609        1.142457  -0.913502    Dhaka  101004.64
30        -0.258074       -0.205629  -1.048654  Rangpur   99937.59
31        -0.276958        1.130554  -1.073249    Dhaka   97483.56
32        -0.226949        0.283924  -1.428988      Ctg   97427.84
33        -0.401129       -0.659324  -0.005884  Rangpur   96778.92
34        -0.600682        1.310535  -0.038282      Ctg   96712.80
35        -0.609750       -1.308658  -0.082863    Dhaka   96479.51
36        -0.991570        0.205925  -0.119935  Rangpur   90708.19
37        -0.652532       -2.525994  -0.154531      Ctg   89949.14
38        -1.177178       -1.997270  -0.253860    Dhaka   81229.06
39        -0.773820       -1.383122  -0.340536      Ctg   81005.76
40        -0.989577       -0.100900  -0.359142      Ctg   78239.91
41        -1.008534       -1.320796  -0.429432  Rangpur   77798.83
42        -1.102106       -0.906938  -0.568488      Ctg   71498.49
43        -1.281134        0.217682  -1.518073    Dhaka   69758.98
44        -1.134305        1.206419  -1.578860      Ctg   65200.33
45        -1.600350        0.101254  -1.802021    Dhaka   64926.08
46        -1.593413       -0.199322   0.690511  Rangpur   49490.75
47        -1.622362        0.507722  -1.818096      Ctg   42559.73
48        -1.610433       -2.509409  -1.818096    Dhaka   35673.41
49        -1.622362       -0.157226  -1.436690      Ctg   14681.40

In [157]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.897913        0.560753   2.165287    Dhaka  192261.83
1         1.955860        1.082807   1.929843      Ctg  191792.06
2         1.754364       -0.728257   1.626191  Rangpur  191050.39
3         1.554784       -0.096365   1.417348    Dhaka  182901.99
4         1.504937       -1.079919   1.273550  Rangpur  166187.94

# LOOP  StandardScaler

In [22]:
import pandas as pd
df = pd.read_csv('supershops.csv')

In [23]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [24]:
x = df.iloc[:, 0:3]

In [25]:
x.head()

   Marketing Spend  Administration  Transport
0        114523.61       136897.80  471784.10
1        162597.70       151377.59  443898.53
2        153441.51       101145.55  407934.54
3        144372.41       118671.85  383199.62
4        142107.34        91391.77  366168.42

In [26]:
y = df.iloc[:, 4]

In [27]:
y.head()

0    192261.83
1    191792.06
2    191050.39
3    182901.99
4    166187.94
Name: Profit, dtype: float64

In [28]:
from sklearn.preprocessing import StandardScaler

In [29]:
std = StandardScaler()

In [14]:
StdSclr = df.copy()
for column in StdSclr:
    if StdSclr[column].dtypes == 'float64'  and column != 'Profit':
        StdSclr[column] = std.fit_transform(StdSclr[[column]])
        
StdSclr.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.897913        0.560753   2.165287    Dhaka  192261.83
1         1.955860        1.082807   1.929843      Ctg  191792.06
2         1.754364       -0.728257   1.626191  Rangpur  191050.39
3         1.554784       -0.096365   1.417348    Dhaka  182901.99
4         1.504937       -1.079919   1.273550  Rangpur  166187.94

# LOOP StandardScaler done by me

In [48]:
import pandas as pd
df = pd.read_csv('supershops.csv')

In [49]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [50]:
df.dtypes

Marketing Spend    float64
Administration     float64
Transport          float64
Area                object
Profit             float64
dtype: object

In [51]:
from sklearn.preprocessing import StandardScaler
std = StandardScaler()

In [52]:
for column in df:
    if df[column].dtypes == 'float64' and column!='Profit':
        df[column] = std.fit_transform(df[[column]])

df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.897913        0.560753   2.165287    Dhaka  192261.83
1         1.955860        1.082807   1.929843      Ctg  191792.06
2         1.754364       -0.728257   1.626191  Rangpur  191050.39
3         1.554784       -0.096365   1.417348    Dhaka  182901.99
4         1.504937       -1.079919   1.273550  Rangpur  166187.94

# Normalization / MinMaxScaler

In [ ]:
'''Normalization is a technique often applied as part of data preparation for machine learning. The goal of normalization is 
to change the value of numeric columns in the dataset to use a common scale,without distorting differences in the ranges of 
values or losing information'''

In [ ]:
'''If you know the minimum and the maximum value of a dataset then use MinMaxScaler, such as CNN,Image Processing'''

In [158]:
import pandas as pd
df = pd.read_csv('supershops.csv')

In [159]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [160]:
x = df.iloc[:, 0:3]

In [161]:
x.head()

   Marketing Spend  Administration  Transport
0        114523.61       136897.80  471784.10
1        162597.70       151377.59  443898.53
2        153441.51       101145.55  407934.54
3        144372.41       118671.85  383199.62
4        142107.34        91391.77  366168.42

In [5]:
y = df.iloc[:, 4]

In [6]:
y.head()

0    192261.83
1    191792.06
2    191050.39
3    182901.99
4    166187.94
Name: Profit, dtype: float64

In [7]:
df.dtypes

Marketing Spend    float64
Administration     float64
Transport          float64
Area                object
Profit             float64
dtype: object

In [8]:
from sklearn.preprocessing import MinMaxScaler

In [9]:
MMS = MinMaxScaler(feature_range = (0,1))

In [10]:
df[['Marketing Spend']] = MMS.fit_transform(df[['Marketing Spend']])

In [11]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617       136897.80  471784.10    Dhaka  192261.83
1         0.983359       151377.59  443898.53      Ctg  191792.06
2         0.927985       101145.55  407934.54  Rangpur  191050.39
3         0.873136       118671.85  383199.62    Dhaka  182901.99
4         0.859438        91391.77  366168.42  Rangpur  166187.94

In [12]:
df[['Administration']] = MMS.fit_transform(df[['Administration']])

In [13]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617        0.651744  471784.10    Dhaka  192261.83
1         0.983359        0.761972  443898.53      Ctg  191792.06
2         0.927985        0.379579  407934.54  Rangpur  191050.39
3         0.873136        0.512998  383199.62    Dhaka  182901.99
4         0.859438        0.305328  366168.42  Rangpur  166187.94

In [14]:
df[['Transport']] = MMS.fit_transform(df[['Transport']])

In [15]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617        0.651744   1.000000    Dhaka  192261.83
1         0.983359        0.761972   0.940893      Ctg  191792.06
2         0.927985        0.379579   0.864664  Rangpur  191050.39
3         0.873136        0.512998   0.812235    Dhaka  182901.99
4         0.859438        0.305328   0.776136  Rangpur  166187.94

# MinMaxScaler applied to whole x

In [17]:
import pandas as pd
df = pd.read_csv('supershops.csv')

In [18]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [19]:
x = df.iloc[:, 0:3]

In [20]:
x.head()

   Marketing Spend  Administration  Transport
0        114523.61       136897.80  471784.10
1        162597.70       151377.59  443898.53
2        153441.51       101145.55  407934.54
3        144372.41       118671.85  383199.62
4        142107.34        91391.77  366168.42

In [21]:
y = df.iloc[:, 4]

In [22]:
y.head()

0    192261.83
1    191792.06
2    191050.39
3    182901.99
4    166187.94
Name: Profit, dtype: float64

In [23]:
from sklearn.preprocessing import MinMaxScaler

In [24]:
MMS = MinMaxScaler(feature_range = (0,1))

In [25]:
x_after_minmaxscaler = MMS.fit_transform(x)

In [26]:
x_after_minmaxscaler

array([[0.69261666, 0.65174393, 1.        ],
       [0.98335946, 0.76197173, 0.94089337],
       [0.92798459, 0.37957895, 0.8646636 ],
       [0.87313643, 0.51299839, 0.81223513],
       [0.85943772, 0.30532804, 0.77613557],
       [0.797566  , 0.3694479 , 0.76912588],
       [0.81412828, 0.73016111, 0.27071031],
       [0.7880179 , 0.71745725, 0.68649342],
       [0.72901786, 0.74173276, 0.66049977],
       [0.74590551, 0.43692884, 0.64644319],
       [0.61635061, 0.45150637, 0.48573267],
       [0.60884455, 0.30836422, 0.52936195],
       [0.56766982, 0.57883556, 0.52956308],
       [0.55635219, 0.64106561, 0.53555202],
       [0.72539353, 0.8013272 , 0.54370828],
       [1.        , 0.54302973, 0.55486446],
       [0.47180821, 0.53527036, 0.56031151],
       [0.57246821, 0.71401273, 0.59894835],
       [0.55488118, 0.47877201, 0.62511553],
       [0.52264964, 0.77823604,        nan],
       [0.46116861, 0.47642362, 0.63305328],
       [0.47408436, 0.78021012, 0.63532724],
       [0.4475048 , 0.54429273, 0.64291963],
       [0.40842369, 0.4146383 , 0.64599195],
       [0.46594728, 0.3653876 , 0.29796428],
       [0.39107967, 0.67195793, 0.29242745],
       [0.45557444, 0.70684477, 0.28413435],
       [0.43609283, 0.58297807, 0.74861321],
       [0.39946683, 1.        , 0.25042853],
       [0.39676926, 0.77456642, 0.22709197],
       [0.37493063, 0.48992809, 0.19316302],
       [0.36974101, 0.77205322, 0.18698856],
       [0.38348453, 0.5932935 , 0.09768292],
       [0.33561668, 0.39413365, 0.45494286],
       [0.2807759 , 0.81005496, 0.44680961],
       [0.2782839 , 0.25703165, 0.43561799],
       [0.17335288, 0.57682456, 0.42631115],
       [0.26652654, 0.        , 0.41762624],
       [0.12234465, 0.11163611, 0.39269043],
       [0.23319442, 0.24130912, 0.3709309 ],
       [0.17390063, 0.51204073, 0.36626005],
       [0.16869099, 0.25446874, 0.34861436],
       [0.14297577, 0.34185188, 0.31370517],
       [0.09377566, 0.57930693, 0.07531871],
       [0.13412668, 0.78807166, 0.06005866],
       [0.0060492 , 0.5547241 , 0.0040356 ],
       [0.00795565, 0.49125975, 0.62976785],
       [0.        , 0.64054682, 0.        ],
       [0.00327821, 0.00350184, 0.        ],
       [0.        , 0.50014806, 0.09574943]])

# LOOP MinMaxScaler

In [27]:
import pandas as pd
df = pd.read_csv('supershops.csv')

In [28]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [29]:
from sklearn.preprocessing import MinMaxScaler

In [30]:
MMS = MinMaxScaler(feature_range = (0,1))

In [31]:
for column in df:
    if (df[column].dtypes == 'float64' or df[column].dtypes == 'int64') and column!='Profit':
        df[column] = MMS.fit_transform(df[[column]])
        
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617        0.651744   1.000000    Dhaka  192261.83
1         0.983359        0.761972   0.940893      Ctg  191792.06
2         0.927985        0.379579   0.864664  Rangpur  191050.39
3         0.873136        0.512998   0.812235    Dhaka  182901.99
4         0.859438        0.305328   0.776136  Rangpur  166187.94

# Another LOOP for MinMaxScaler

In [32]:
import pandas as pd
df = pd.read_csv('supershops.csv')

In [33]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [34]:
df.dtypes

Marketing Spend    float64
Administration     float64
Transport          float64
Area                object
Profit             float64
dtype: object

In [35]:
from sklearn.preprocessing import MinMaxScaler

In [36]:
MMS = MinMaxScaler(feature_range = (0,1))

In [37]:
mx = df.copy()
for column in mx:
    if (mx[column].dtypes == 'float64' or mx[column].dtypes == 'int64') and column!='Profit':
        mx[column] = MMS.fit_transform(df[[column]])
        
mx.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617        0.651744   1.000000    Dhaka  192261.83
1         0.983359        0.761972   0.940893      Ctg  191792.06
2         0.927985        0.379579   0.864664  Rangpur  191050.39
3         0.873136        0.512998   0.812235    Dhaka  182901.99
4         0.859438        0.305328   0.776136  Rangpur  166187.94

# MaxAbsScaler

In [ ]:
'''MaxAbsScaling is used where there is a lot of sparse data, sparse data means 
there is a lot of zeros in your dataset.'''
# MaxAbsScaler works on numeric data

In [1]:
import pandas as pd
import numpy as np

df = pd.read_csv('supershops.csv',usecols = [0,1,2])

In [2]:
df.head()

   Marketing Spend  Administration  Transport
0        114523.61       136897.80  471784.10
1        162597.70       151377.59  443898.53
2        153441.51       101145.55  407934.54
3        144372.41       118671.85  383199.62
4        142107.34        91391.77  366168.42

In [3]:
from sklearn.preprocessing import MaxAbsScaler

In [4]:
MAS = MaxAbsScaler()

In [5]:
df_scaled = MAS.fit_transform(df)

In [6]:
df_scaled

array([[0.69261666, 0.74952712, 1.        ],
       [0.98335946, 0.8288052 , 0.94089337],
       [0.92798459, 0.5537805 , 0.8646636 ],
       [0.87313643, 0.64973849, 0.81223513],
       [0.85943772, 0.50037773, 0.77613557],
       [0.797566  , 0.54649404, 0.76912588],
       [0.81412828, 0.80592635, 0.27071031],
       [0.7880179 , 0.79678948, 0.68649342],
       [0.72901786, 0.81424892, 0.66049977],
       [0.74590551, 0.59502771, 0.64644319],
       [0.61635061, 0.60551217, 0.48573267],
       [0.60884455, 0.50256141, 0.52936195],
       [0.56766982, 0.69708993, 0.52956308],
       [0.55635219, 0.74184705, 0.53555202],
       [0.72539353, 0.85711046, 0.54370828],
       [1.        , 0.67133764, 0.55486446],
       [0.47180821, 0.66575694, 0.56031151],
       [0.57246821, 0.79431211, 0.59894835],
       [0.55488118, 0.62512218, 0.62511553],
       [0.52264964, 0.84050283,        nan],
       [0.46116861, 0.62343317, 0.63305328],
       [0.47408436, 0.84192263, 0.63532724],
       [0.4475048 , 0.67224602, 0.64291963],
       [0.40842369, 0.5789959 , 0.64599195],
       [0.46594728, 0.54357379, 0.29796428],
       [0.39107967, 0.76406544, 0.29242745],
       [0.45557444, 0.78915677, 0.28413435],
       [0.43609283, 0.7000693 , 0.74861321],
       [0.39946683, 1.        , 0.25042853],
       [0.39676926, 0.83786356, 0.22709197],
       [0.37493063, 0.63314586, 0.19316302],
       [0.36974101, 0.83605602, 0.18698856],
       [0.38348453, 0.70748837, 0.09768292],
       [0.33561668, 0.56424854, 0.45494286],
       [0.2807759 , 0.86338765, 0.44680961],
       [0.2782839 , 0.46564198, 0.43561799],
       [0.17335288, 0.69564357, 0.42631115],
       [0.26652654, 0.28077956, 0.41762624],
       [0.12234465, 0.36107053, 0.39269043],
       [0.23319442, 0.45433401, 0.3709309 ],
       [0.17390063, 0.64904972, 0.36626005],
       [0.16869099, 0.46379868, 0.34861436],
       [0.14297577, 0.52664642, 0.31370517],
       [0.09377566, 0.69742894, 0.07531871],
       [0.13412668, 0.8475768 , 0.06005866],
       [0.0060492 , 0.67974847, 0.0040356 ],
       [0.00795565, 0.63410362, 0.62976785],
       [0.        , 0.74147392, 0.        ],
       [0.00327821, 0.28329815, 0.        ],
       [0.        , 0.64049627, 0.09574943]])

In [7]:
type(df_scaled)

numpy.ndarray

In [8]:
df_scaled1 = pd.DataFrame({
    'Marketing Spend': df_scaled[:, 0],
    'Administration':df_scaled[:, 1],
    'Transport':df_scaled[:, 2]
})

print(df_scaled1)

    Marketing Spend  Administration  Transport
0          0.692617        0.749527   1.000000
1          0.983359        0.828805   0.940893
2          0.927985        0.553781   0.864664
3          0.873136        0.649738   0.812235
4          0.859438        0.500378   0.776136
5          0.797566        0.546494   0.769126
6          0.814128        0.805926   0.270710
7          0.788018        0.796789   0.686493
8          0.729018        0.814249   0.660500
9          0.745906        0.595028   0.646443
10         0.616351        0.605512   0.485733
11         0.608845        0.502561   0.529362
12         0.567670        0.697090   0.529563
13         0.556352        0.741847   0.535552
14         0.725394        0.857110   0.543708
15         1.000000        0.671338   0.554864
16         0.471808        0.665757   0.560312
17         0.572468        0.794312   0.598948
18         0.554881        0.625122   0.625116
19         0.522650        0.840503        NaN
20         0.461169        0.623433   0.633053
21         0.474084        0.841923   0.635327
22         0.447505        0.672246   0.642920
23         0.408424        0.578996   0.645992
24         0.465947        0.543574   0.297964
25         0.391080        0.764065   0.292427
26         0.455574        0.789157   0.284134
27         0.436093        0.700069   0.748613
28         0.399467        1.000000   0.250429
29         0.396769        0.837864   0.227092
30         0.374931        0.633146   0.193163
31         0.369741        0.836056   0.186989
32         0.383485        0.707488   0.097683
33         0.335617        0.564249   0.454943
34         0.280776        0.863388   0.446810
35         0.278284        0.465642   0.435618
36         0.173353        0.695644   0.426311
37         0.266527        0.280780   0.417626
38         0.122345        0.361071   0.392690
39         0.233194        0.454334   0.370931
40         0.173901        0.649050   0.366260
41         0.168691        0.463799   0.348614
42         0.142976        0.526646   0.313705
43         0.093776        0.697429   0.075319
44         0.134127        0.847577   0.060059
45         0.006049        0.679748   0.004036
46         0.007956        0.634104   0.629768
47         0.000000        0.741474   0.000000
48         0.003278        0.283298   0.000000
49         0.000000        0.640496   0.095749

# LOOP MaxAbsScaler

In [11]:
import pandas as pd
import numpy as np

df = pd.read_csv('supershops.csv')

In [12]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [13]:
from sklearn.preprocessing import MaxAbsScaler

In [14]:
maxabs = MaxAbsScaler()

In [16]:
for column in df:
    if (df[column].dtypes == 'float64' or df[column].dtypes == 'int64') and column != 'Profit':
        df[column] = maxabs.fit_transform(df[[column]])
        
print(df.head())

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617        0.749527   1.000000    Dhaka  192261.83
1         0.983359        0.828805   0.940893      Ctg  191792.06
2         0.927985        0.553781   0.864664  Rangpur  191050.39
3         0.873136        0.649738   0.812235    Dhaka  182901.99
4         0.859438        0.500378   0.776136  Rangpur  166187.94

# Robust Scaling

In [ ]:
# IQR = 75th percentile value - 25th percentile value
# If you dataset has got a lot of outliers, then use robust scaling

In [45]:
import pandas as pd
df = pd.read_csv('supershops.csv', usecols = [0,1,2])

In [46]:
df.head()

   Marketing Spend  Administration  Transport
0        114523.61       136897.80  471784.10
1        162597.70       151377.59  443898.53
2        153441.51       101145.55  407934.54
3        144372.41       118671.85  383199.62
4        142107.34        91391.77  366168.42

In [47]:
from sklearn.preprocessing import RobustScaler

In [48]:
rs = RobustScaler()

In [49]:
df_scaled = rs.fit_transform(df)

In [50]:
df_scaled

array([[ 0.67253009,  0.34535525,  1.55201644],
       [ 1.45211292,  0.6975647 ,  1.38371396],
       [ 1.3036336 , -0.52428997,  1.16665443],
       [ 1.15656655, -0.09797658,  1.0173676 ],
       [ 1.11983554, -0.76154296,  0.91457633],
       [ 0.95393588, -0.5566616 ,  0.89461668],
       [ 0.99834513,  0.59592064, -0.52459079],
       [ 0.9283341 ,  0.55532815,  0.65932587],
       [ 0.77013442,  0.63289538,  0.58531056],
       [ 0.8154161 , -0.34104062,  0.54528533],
       [ 0.46803423, -0.29446122,  0.08767206],
       [ 0.44790788, -0.75184149,  0.21190373],
       [ 0.33750405,  0.11239208,  0.21247644],
       [ 0.30715756,  0.31123495,  0.22952959],
       [ 0.76041632,  0.82331673,  0.25275401],
       [ 1.49673201, -0.00201781,  0.28452056],
       [ 0.08046566, -0.02681124,  0.30003068],
       [ 0.35037021,  0.54432193,  0.41004671],
       [ 0.30321327, -0.20733968,  0.48455614],
       [ 0.21678926,  0.74953386,         nan],
       [ 0.05193717, -0.21484346,  0.50715837],
       [ 0.08656882,  0.75584161,  0.51363334],
       [ 0.01529973,  0.00201781,  0.53525221],
       [-0.08949034, -0.41226531,  0.54400044],
       [ 0.06475046, -0.56963541, -0.4469868 ],
       [-0.13599571,  0.40994478, -0.46275259],
       [ 0.03693728,  0.52141826, -0.48636666],
       [-0.01529973,  0.12562858,  0.83620813],
       [-0.11350681,  1.45813335, -0.5823419 ],
       [-0.12073992,  0.73780837, -0.64879132],
       [-0.1792969 , -0.1716928 , -0.74540191],
       [-0.19321209,  0.72977798, -0.76298329],
       [-0.15636092,  0.15858935, -1.01727556],
       [-0.28471131, -0.47778354,  0.        ],
       [-0.43175858,  0.85120443, -0.02315894],
       [-0.43844049, -0.91586378, -0.05502639],
       [-0.71979714,  0.10596635, -0.08152705],
       [-0.46996607, -1.73715369, -0.10625678],
       [-0.85656799, -1.38044426, -0.17725996],
       [-0.55934112, -0.96610178, -0.23921887],
       [-0.71832843, -0.10103656, -0.25251881],
       [-0.7322973 , -0.92405301, -0.30276385],
       [-0.80124875, -0.64483881, -0.4021656 ],
       [-0.93317142,  0.11389823, -1.08095627],
       [-0.82497625,  0.78096147, -1.12440833],
       [-1.16839665,  0.03534904, -1.28393053],
       [-1.16328479, -0.16743776,  0.49780333],
       [-1.18461665,  0.30957726, -1.29542164],
       [-1.17582662, -1.72596431, -1.29542164],
       [-1.18461665, -0.13903706, -1.02278106]])

In [51]:
df_scaled = pd.DataFrame({
    'Marketing Spend':df_scaled[:, 0],
    'Administration':df_scaled[:, 1],
    'Transport':df_scaled[:, 2]
})

print(df_scaled)

    Marketing Spend  Administration  Transport
0          0.672530        0.345355   1.552016
1          1.452113        0.697565   1.383714
2          1.303634       -0.524290   1.166654
3          1.156567       -0.097977   1.017368
4          1.119836       -0.761543   0.914576
5          0.953936       -0.556662   0.894617
6          0.998345        0.595921  -0.524591
7          0.928334        0.555328   0.659326
8          0.770134        0.632895   0.585311
9          0.815416       -0.341041   0.545285
10         0.468034       -0.294461   0.087672
11         0.447908       -0.751841   0.211904
12         0.337504        0.112392   0.212476
13         0.307158        0.311235   0.229530
14         0.760416        0.823317   0.252754
15         1.496732       -0.002018   0.284521
16         0.080466       -0.026811   0.300031
17         0.350370        0.544322   0.410047
18         0.303213       -0.207340   0.484556
19         0.216789        0.749534        NaN
20         0.051937       -0.214843   0.507158
21         0.086569        0.755842   0.513633
22         0.015300        0.002018   0.535252
23        -0.089490       -0.412265   0.544000
24         0.064750       -0.569635  -0.446987
25        -0.135996        0.409945  -0.462753
26         0.036937        0.521418  -0.486367
27        -0.015300        0.125629   0.836208
28        -0.113507        1.458133  -0.582342
29        -0.120740        0.737808  -0.648791
30        -0.179297       -0.171693  -0.745402
31        -0.193212        0.729778  -0.762983
32        -0.156361        0.158589  -1.017276
33        -0.284711       -0.477784   0.000000
34        -0.431759        0.851204  -0.023159
35        -0.438440       -0.915864  -0.055026
36        -0.719797        0.105966  -0.081527
37        -0.469966       -1.737154  -0.106257
38        -0.856568       -1.380444  -0.177260
39        -0.559341       -0.966102  -0.239219
40        -0.718328       -0.101037  -0.252519
41        -0.732297       -0.924053  -0.302764
42        -0.801249       -0.644839  -0.402166
43        -0.933171        0.113898  -1.080956
44        -0.824976        0.780961  -1.124408
45        -1.168397        0.035349  -1.283931
46        -1.163285       -0.167438   0.497803
47        -1.184617        0.309577  -1.295422
48        -1.175827       -1.725964  -1.295422
49        -1.184617       -0.139037  -1.022781

In [52]:
df_scaled.head()

   Marketing Spend  Administration  Transport
0         0.672530        0.345355   1.552016
1         1.452113        0.697565   1.383714
2         1.303634       -0.524290   1.166654
3         1.156567       -0.097977   1.017368
4         1.119836       -0.761543   0.914576

# LOOP RobustScaler

In [35]:
import pandas as pd
df = pd.read_csv('supershops.csv')

In [36]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [37]:
from sklearn.preprocessing import RobustScaler

In [38]:
rs = RobustScaler()

In [40]:
for column in df:
    if (df[column].dtypes == 'float64' or df[column].dtypes == 'int64') and column != 'Profit':
        df[column] = rs.fit_transform(df[[column]])
        
print(df.head())

   Marketing Spend  Administration  Transport     Area     Profit
0         0.672530        0.345355   1.552016    Dhaka  192261.83
1         1.452113        0.697565   1.383714      Ctg  191792.06
2         1.303634       -0.524290   1.166654  Rangpur  191050.39
3         1.156567       -0.097977   1.017368    Dhaka  182901.99
4         1.119836       -0.761543   0.914576  Rangpur  166187.94